[
    {"qId": "wqr000001", "answers": ["Lower than 3.7(D+) "], "qText": "what is academic probation gpa ?"},
    {"qId": "wqr000002", "answers": ["The academic load per semester for under probation student will be reduced in order to be able to have a better chance to improve their overall GPA"], "qText": "Is the academic load the same for students under probation?"},
    {"qId": "wqr000003", "answers": ["A student shall be given two subsequent terms for enrollment on probation status"], "qText": "How many terms can I be under academic probation ?"},
    {"qId": "wqr000004", "answers": ["At the conclusion of the two semesters  a student who has not achieved a cumulative GPA better than 3.7 (D+) shall be asked to transfer to another university"], "qText": "what happens if I stayed under probation for more than two subsequent terms?"},
    {"qId": "wqr000005", "answers": ["No  an academic advisor schedules a meeting with the student under probation and suggest the courses that the student may enroll in ."], "qText": "Do I choose the courses on my own in case of probation ?"},
    {"qId": "wqr000006", "answers": ["After normal students schedules "], "qText": "when the schedules are released for students under probation ?"},
    {"qId": "wqr000007", "answers": ["For further information, you may contact the probation office."], "qText": "For more information regrading probation , who can I contact ?"},
    {"qId": "wqr00008", "answers": ["Two rounds."], "qText": "How many rounds are in the summer ?"},
    {"qId": "wqr00009", "answers": ["Maximum eight credit hours in one round."], "qText": "How many courses can I take in one round ?"},
    {"qId": "wqr000010", "answers": ["Lectures and tutorials and labs all of them have attendance"], "qText": "What is the attendance policy in summer ?"},
    {"qId": "wqr000011", "answers": ["No some courses may not be available in the summer if there are not enough number of students"], "qText": "Are all the courses available in summer ?"},
    {"qId": "wqr000012", "answers": ["Yes you can but you should complete its prerequisites first"], "qText": "Can I take a course in the summer to decrease the load in the regular semester ?"},
    {"qId": "wqr000013", "answers": ["No  round 1 is not available for first year engineering students  because chemistry lab is offered in round 1 and its obligatory."], "qText": "Are all summer rounds available for all students ? "},
    {"qId": "wqr000014", "answers": ["Yes  but you may not find a spot if the course is fully enrolled."], "qText": "Is there a late registration in summer courses ?"},
    {"qId": "wqr000015", "answers": ["Yes  same as regular semester "], "qText": "Is the content of the summer course the same as the regular semester ?"},
    {"qId": "wqr000016", "answers": ["No midterm exam is not offered "], "qText": "Do summer courses have midterm exam ?"},
    {"qId": "wqr000017", "answers": ["One Month for each round "], "qText": "What is the duration of each summer round ?"},
    {"qId": "wqr000018", "answers": ["Yes"], "qText": "Do summer courses have Final exam ?"},
    {"qId": "wqr000019", "answers": ["Yes"], "qText": "Do summer courses have projects ?"},
    {"qId": "wqr000020", "answers": ["Yes"], "qText": "Do summer courses have quizzes ?"},
    {"qId": "wqr000021", "answers": ["Yes"], "qText": "Do summer courses have assignments ?"},
    {"qId": "wqr000022", "answers": ["Yes but only within one academic year ."], "qText": " Can I improve a course in summer?"},
    {"qId": "wqr000023", "answers": ["by watching tutorials and trying to implement mini projects by yourself "], "qText": "How can I study cs courses ?"},
    {"qId": "wqr000024", "answers": ["by solving past exams and trying to understand the lecture slides explaining the concepts "], "qText": "How I can study for my exams ?"},
    {"qId": "wqr000025", "answers": ["Try to collect as much information during the lectures and the tutorials as much as you can, this will save you time studying. List all the deadlines and give each one a score with its weight, how much time is needed to finish that assignment vs how much time you have, and what are the most important requirements of each assignment."], "qText": "How to organize my study?"},
    {"qId": "wqr000026", "answers": ["Depending on the case, you could ask your advisor or coordinator."], "qText": "Can advising students go to Berlin?"},
    {"qId": "wqr000027", "answers": ["If you are an advising student then you can make your graduation plan with your advisor."], "qText": "Who can I go to if I want to plan my next semesters so that I could graduate as early as possible? "},
    {"qId": "wqr000028", "answers": ["During the academic semester, you are only required to focus on your study and academic duties. Working on the projects and assignments is part of the academic experience to teach you time management."], "qText": "How could I work and study at the same time even though studying alone takes all our time?"},
    {"qId": "wqr000029", "answers": ["Try to collect as much information during the lectures and the tutorials as much as you can, this will save you time studying. List all the deadlines and give each one a score with its weight, how much time is needed to finish that assignment vs how much time you have, and what are the most important requirements of each assignment."], "qText": "How do I manage my time properly?"},
    {"qId": "wqr000030", "answers": ["Focus on the main points in the session, it’s better if you have the session slides with you so you can add notes directly on them."], "qText": "How can I take notes efficiently? "},
    {"qId": "wqr000031", "answers": ["List all the deadlines and give each one a score with its weight, how much time is needed to finish that assignment vs how much time you have, and what are the most important requirements of each assignment."], "qText": "How do I organize my schedule efficiently?"},
    {"qId": "wqr000032", "answers": ["The grade of one course does not affect your career, recruiters focus on the overall performance."], "qText": "If I got a D grade in data structure and algorithm course, should I take an improvement exam? or It will not affect my career."},
    {"qId": "wqr000033", "answers": ["Start by listing all the content you have taken so far, mark them with your level of understanding; attended or not attended, how much you understand that lecture for example. Then start listing your quizzes/projects/assignments/etc. Including their weights, deadlines, and how much time they need."], "qText": "what are study tips and info about the met subjects ?"},
    {"qId": "wqr000034", "answers": ["List all the deadlines and give each one a score with its weight, how much time is needed to finish that assignment vs how much time you have, and what are the most important requirements of each assignment."], "qText": "How to handle deadlines? "},
    {"qId": "wqr000035", "answers": ["In case you are an advising student yes, you need to discuss this with your advisor and coordinator"], "qText": "can I do my bachelor project on the 10th semester ?"}              
    ]